In [77]:
#dataframe: is a 2d tabular dataset with rows and columns, similar to an excel sheet
import pandas as pd

#creating a data frame through a dictionary 
emp_data={
    "name":["abd","hus","has","zain"],
    "age":[20,13,12,18],
    "salary":[1000,2000,4000,2000]
}
df=pd.DataFrame(emp_data)
print(df)

   name  age  salary
0   abd   20    1000
1   hus   13    2000
2   has   12    4000
3  zain   18    2000

In [78]:
#changing the index of the values in the dataframe
df=pd.DataFrame(emp_data,index=["emp1","emp2","emp3","emp4"])
print(df)

      name  age  salary
emp1   abd   20    1000
emp2   hus   13    2000
emp3   has   12    4000
emp4  zain   18    2000

In [79]:
#accessing each row(all information about a single employee)
#1. using loc(location by label)

print(df.loc["emp1"])

#2. using iloc(location by index)
print("\n")
print(df.iloc[3])

name       abd
age         20
salary    1000
Name: emp1, dtype: object


name      zain
age         18
salary    2000
Name: emp4, dtype: object

In [80]:
#adding a new column or columns to existing data frame
print(df)
print("\n")
df["job"]=["engineer","marketing","relation","finance"]
print(df)

      name  age  salary
emp1   abd   20    1000
emp2   hus   13    2000
emp3   has   12    4000
emp4  zain   18    2000


      name  age  salary        job
emp1   abd   20    1000   engineer
emp2   hus   13    2000  marketing
emp3   has   12    4000   relation
emp4  zain   18    2000    finance

In [81]:
#adding multiple new columns to the existing dataframe 
df[["exp", "loc"]]=pd.DataFrame({
    "exp" : [1,2,3,4],
    "loc":["mum","pune","bangalore","andhra"]
},
index=df.index)
print(df)

      name  age  salary        job  exp        loc
emp1   abd   20    1000   engineer    1        mum
emp2   hus   13    2000  marketing    2       pune
emp3   has   12    4000   relation    3  bangalore
emp4  zain   18    2000    finance    4     andhra

In [82]:
#adding a new row to the existing dataframe
#1. create a new dataframe having each column and its value
new_row=pd.DataFrame([{
    "name":"zoh",
    "age":40,
    "salary":1000,
    "job":"ceo",
    "exp":10,
    "loc":"mum"
}], index=["emp5"])
#2.concatenate the new row with the existing dataframe
df=pd.concat([df,new_row])
print(df)

      name  age  salary        job  exp        loc
emp1   abd   20    1000   engineer    1        mum
emp2   hus   13    2000  marketing    2       pune
emp3   has   12    4000   relation    3  bangalore
emp4  zain   18    2000    finance    4     andhra
emp5   zoh   40    1000        ceo   10        mum

In [83]:
#alternate method to add a new row (eaasier)
df.loc["emp6"]=["farq",50,10000,"agent",15,"jam"]
print(df)

      name  age  salary        job  exp        loc
emp1   abd   20    1000   engineer    1        mum
emp2   hus   13    2000  marketing    2       pune
emp3   has   12    4000   relation    3  bangalore
emp4  zain   18    2000    finance    4     andhra
emp5   zoh   40    1000        ceo   10        mum
emp6  farq   50   10000      agent   15        jam

In [ ]:
#adding multiple rows using the concat method
df1=pd.DataFrame({
    "name":["abdullah","husain","anas","moin"],
    "age":[15,20,12,10],
    "rollno":[29,11,2,3]
})
print(df1)
print("\n")

new_rows=pd.DataFrame([
    {
        "name":"hasnain",
        "age":12,
        "rollno":26
    },
    {
        "name":"husain",
        "age":13,
        "rollno":27
    }
    ], index=[4,5])
df1=pd.concat([df1,new_rows])
print(df1)

#to add multiple rows using the loc method ,just write the loc statement multiple times

       name  age  rollno
0  abdullah   15      29
1    husain   20      11
2      anas   12       2
3      moin   10       3


       name  age  rollno
0  abdullah   15      29
1    husain   20      11
2      anas   12       2
3      moin   10       3
4   hasnain   12      26
5    husain   13      27

In [89]:
#practicing adding new column 

#adding a single new column
df1["marks"]=pd.DataFrame({
    "marks":[100,99,99,10,88,99]
})
print(df1)

#adding multiple new column
df1[["grade","result"]]=pd.DataFrame({
    "grade":["O","O","O","F","A","O"],
    "result":["pass","pass","pass","fail","pass","pass"]
})
print("\n")
print(df1)

       name  age  rollno  marks
0  abdullah   15      29    100
1    husain   20      11     99
2      anas   12       2     99
3      moin   10       3     10
4   hasnain   12      26     88
5    husain   13      27     99


       name  age  rollno  marks grade result
0  abdullah   15      29    100     O   pass
1    husain   20      11     99     O   pass
2      anas   12       2     99     O   pass
3      moin   10       3     10     F   fail
4   hasnain   12      26     88     A   pass
5    husain   13      27     99     O   pass